Revit 2024 API
RebarHookType.GetDefaultHookExtension Method
 Computes the default hook length, which is equal to barDiameter * multiplier.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double GetDefaultHookExtension(
	double barDiameter
)
Visual Basic
Public Function GetDefaultHookExtension ( _
	barDiameter As Double _
) As Double
Visual C++
public:
double GetDefaultHookExtension(
	double barDiameter
)
Parameters
barDiameter
Type: System.Double
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace